Revit 2024 API
ExternalGeometryId.Id Property
 External geometry identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string Id { get; }
Visual Basic
Public ReadOnly Property Id As String
	Get
Visual C++
public:
property String^ Id {
	String^ get ();
}
See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace